#include <stdlib.h>
#include <time.h>
#include <stdbool.h>

/**
 * @file ex3.c реалізація функції, що визначає, скільки серед заданої послідовності чисел таких пар, у котрих перше числе меньше наступного
 * 
*/

/**
 * реалізація функції, що повертає значення кількості пар, що визначає функція, після обробки масиву
 * @param array[] наш масив, у якому задані числа
 */

int function(int array[]);

/**
головна функція  {
 *  Послідовність дій:
 * <ul>
 * <li> запис функції, що задає при кожному новому запуску нове значення кожного елементу масиву</li>
 * <li> оголосимо наш масив та число, що буде відповіддю до нашого завдання</li>
 * <li> запис псевдовипадкових чисел до масиву</li>
 * @return  м - значення кількості пар , у котрих перше число менше за наступне
 * </ul>}
*/

int main(){
    srand(time(NULL));
    int array[8];
    int m;
    for (int i = 0; i < 8; i++){
        array[i] = rand()%100;
    }
    m = function(array);
    return 0;
}

int function(int array[]){
    
    int m = 0;
    bool flag = false;
    for (int i = 0; i < 8; i++){
        if(array[i+1] > array[i] ){
            flag = true;
        }
        if(flag){
            m++;
        }
        flag = false;
    }
    return m;
}